app/Admin/Extensions/Nav/Dropdown.php

select `id`, `name`, `file_excel` from `template_excel`
---
  public function render()
  {
    $q_excel = TemplateExcel::select('id', 'name', 'file_excel')->get();