app/Helpers/System.php

function getProgressActual($project_id, $start_date)
{
    $sum_bobot_real = TranBaseline::where('project_id', $project_id)
        ->whereNotIn('activity_id', [20, 21])
        ->whereBetween('actual_start', [$start_date, date('Y-m-d')])
        ->selectRaw('ROUND(SUM(bobot * (actual_progress/100 )), 1) as total')
        ->value('total');

    $sum_bobot_ct_ut = TranBaseline::where('project_id', $project_id)
        ->whereIn('activity_id', [20, 21])
        ->whereBetween('actual_finish', [$start_date, date('Y-m-d')])
        ->selectRaw('ROUND(SUM(bobot * (actual_progress/100 )), 1) as total')
        ->value('total');
---
select ROUND(SUM(bobot * (actual_progress/100 )), 1) as total from `tran_baseline` where `project_id` = 67 and `activity_id` not in (20, 21) and `actual_start` between '2023-04-01' and '2023-07-10' limit 1
select ROUND(SUM(bobot * (actual_progress/100 )), 1) as total from `tran_baseline` where `project_id` = 67 and `activity_id` in (20, 21) and `actual_finish` between '2023-04-01' and '2023-07-10' limit 1

function getProgressPlan($project_id, $start_date)
{
    $sum_bobot_plan = LogPlan::where('project_id', $project_id)
        ->whereBetween('log_date', [$start_date, date('Y-m-d')])
        ->selectRaw('ROUND(SUM(log_bobot), 1) as total')
        ->value('total');
---
select ROUND(SUM(log_bobot), 1) as total from `log_plan` where `project_id` = 67 and `log_date` between '2023-04-01' and '2023-07-10' limit 1

function pendingItemUT($project_id)
{
    $query = TranBaseline::where('project_id', $project_id)
        ->where('activity_id', 21)
        ->where('pending_item', 'YA')
        ->exists();
---
select exists(select * from `tran_baseline` where `project_id` = 67 and `activity_id` = 21 and `pending_item` = 'YA') as `exists`

function cek_commisioning_tes($project_id)
{
    $query = TranBaseline::select('actual_finish')
        ->where('project_id', $project_id)
        ->whereNotNull('actual_finish')
        ->where('actual_finish', '<>', '')
        ->where('activity_id', 20)->exists();
---
select exists(select `actual_finish` from `tran_baseline` where `project_id` = 1877 and `actual_finish` is not null and `actual_finish` <> '' and `activity_id` = 20) as `exists`

function getUserId($role, $id)
{
    if ($role == 'mitra') {
        $user = MstMitra::select('mst_mitra.nama_mitra AS name', 'mst_mitra.*')
            ->where('id', $id)
            ->first();
---
select `mst_mitra`.`nama_mitra` as `name`, `mst_mitra`.* from `mst_mitra` where `id` = 7 and `mst_mitra`.`deleted_at` is null limit 1

function getUser()
{
    $role = activeGuard();
    $id = auth($role)->user()->id;

    if ($role == 'mitra') {
        $user = MstMitra::select('mst_mitra.nama_mitra AS name', 'mst_mitra.*')
            ->where('id', $id)
            ->first();
---
select `mst_mitra`.`nama_mitra` as `name`, `mst_mitra`.* from `mst_mitra` where `id` = 43 and `mst_mitra`.`deleted_at` is null limit 1