app/Admin/Controllers/MstProjectController.php

            }
        });

        $tematiks = MstProject::select('tematik')
            ->groupBy('tematik')
            ->get()
---
select `tematik` from `mst_project` where `mst_project`.`deleted_at` is null group by `tematik`

            $tematik[$item->tematik] = $item->tematik;
        }

        $grid->filter(function ($filter) use ($tematik) {
            $filter->disableIdFilter();
            if (Admin::user()->inRoles(['administrator'])) {
                $filter->scope('trashed', 'Recycle Bin')->onlyTrashed();
            }

            $filter->column(1 / 2, function ($filter) use ($tematik) {
                $filter->like('lop_site_id', 'LOP / SITE ID');
                $filter->in('status_project', 'STATUS PROJECT')->multipleSelect(['USULAN' => 'USULAN', 'DONE DRM' => 'DONE DRM', 'PELIMPAHAN' => 'PELIMPAHAN', 'PO' => 'PO/SP', 'DROP' => 'DROP']);
                $filter->in('tematik', 'TEMATIK')->multipleSelect($tematik);
                $filter->in('witel_id', 'WITEL')->multipleSelect(
                    MstWitel::join('admin_role_users', 'admin_users.id', '=', 'admin_role_users.user_id')
                    ->where('admin_role_users.role_id', '2')->pluck('name', 'kode_user')
                  );
                $filter->in('mitra_id', 'MITRA')->multipleSelect(
                    MstMitra::pluck('nama_mitra', 'kode_mitra')
                  );
            });

            $filter->column(1 / 2, function ($filter) {

---
select `name`, `kode_user` from `admin_users` inner join `admin_role_users` on `admin_users`.`id` = `admin_role_users`.`user_id` where `admin_role_users`.`role_id` = '2' and `admin_users`.`deleted_at` is null
select `nama_mitra`, `kode_mitra` from `mst_mitra` where `mst_mitra`.`deleted_at` is null