app/Admin/Controllers/TranInventoryController.php

select `name`, `id` from `admin_users` inner join `admin_role_users` on `admin_users`.`id` = `admin_role_users`.`user_id` where `admin_role_users`.`role_id` = '2' and `admin_users`.`deleted_at` is null
select `nama_mitra`, `id` from `mst_mitra` where `mst_mitra`.`deleted_at` is null
---
    protected function grid()
    {

        $grid = new Grid(new TranSupervisi());
        $grid->model()->whereIn('status_const', ['INSTALL DONE', 'SELESAI UT', 'SELESAI CT', 'REKON', 'SELESAI REKON', 'BAST-1']);
        //$grid->model()->join('tran_baseline', 'tran_supervisi.project_id', '=', 'tran_baseline.project_id')->where('tran_baseline.activity_id', '=',  19)->where('tran_baseline.actual_finish', '>',  0);
        $grid->disableCreateButton();
        $grid->disableRowSelector();
        $grid->disableColumnSelector();
        $grid->actions(function ($actions) {

            $actions->add(new Odp);
            $actions->disableEdit();
            $actions->disableDelete();
            $actions->disableView();
        });
        $grid->filter(function ($filter) {
            // Remove the default id filter
            $filter->disableIdFilter();

            $filter->column(1 / 2, function ($filter) {
                $filter->like('project_name', 'LOP / SITE ID');
                $filter->in('supervisi_project.tematik', 'TEMATIK')->multipleSelect(['PT3' => 'PT3', 'PT2' => 'PT2', 'NODE-B' => 'NODE-B', 'OLO' => 'OLO', 'HEM' => 'HEM', 'ISP' => 'ISP', 'FTTH 2022' => 'FTTH 2022']);
                $filter->in('witel_id', 'WITEL')->multipleSelect(
                    MstWitel::join('admin_role_users', 'admin_users.id', '=', 'admin_role_users.user_id')
                        ->where('admin_role_users.role_id', '2')->pluck('name', 'id')
                );
                $filter->in('mitra_id', 'MITRA')->multipleSelect(
                    MstMitra::pluck('nama_mitra', 'id')
                );
                $filter->in('status_gl_sdi', 'STATUS GL SDI')->multipleSelect([
                    'NO DATA' => 'NO DATA',
                    'VALIDASI ABD' => 'VALIDASI ABD',
                    'DRAWING' => 'DRAWING',
                    'INVENTORY' => 'INVENTORY',
                    'TERMINASI UIM' => 'TERMINASI UIM',
                    'GOLIVE PARSIAL' => 'GOLIVE PARSIAL',
                    'GOLIVE' => 'GOLIVE',
                    'KENDALA' => 'KENDALA',
                ]);
            });

select * from `tran_supervisi` where `id` = '1' limit 1
select * from `tran_odp` where `supervisi_id` = '1'
---
    protected function detail($id)
    {
        $kode_odp = '';
        $start = 0;
        $finish = 0;
        if (isset($_GET['kode_odp'])) {
            $kode_odp = $_GET['kode_odp'];
        }
        if (isset($_GET['start'])) {
            $start = $_GET['start'];
        }
        if (isset($_GET['finish'])) {
            $finish = $_GET['finish'];
        }

        if ($start > $finish) {
            admin_error('Generate gagal, Pastikan start tidak lebih besar dari finish');
            admin_toastr('Pastikan start tidak lebih besar dari finish', 'danger');
            return back();
        }

        //$data = MstProject::findOrFail($id);
        $supervisi = TranSupervisi::where('id', $id)->first();
        $listOdp = TranOdp::where('supervisi_id', $id)->get();