app/Admin/Controllers/TranAdministrasiController.php

select `name`, `id` from `admin_users` inner join `admin_role_users` on `admin_users`.`id` = `admin_role_users`.`user_id` where `admin_role_users`.`role_id` = '2' and `admin_users`.`deleted_at` is null
select `nama_mitra`, `id` from `mst_mitra` where `mst_mitra`.`deleted_at` is null
---
    protected function grid()
    {
        $grid = new Grid(new TranAdministrasi());
        if (Admin::user()->inRoles(['witel'])) {
            $grid->model()->where('witel_id', '=', Admin::user()->id);
        }
        $grid->filter(function ($filter) {
            $filter->disableIdFilter();
            $filter->column(1 / 2, function ($filter) {
              $filter->like('project_name', 'LOP / SITE ID');
              $filter->in('project.tematik', 'TEMATIK')->multipleSelect(['PT3' => 'PT3', 'PT2' => 'PT2', 'NODE-B' => 'NODE-B', 'OLO' => 'OLO', 'HEM' => 'HEM', 'ISP' => 'ISP', 'FTTH 2022' => 'FTTH 2022']);
              $filter->in('witel_id', 'WITEL')->multipleSelect(
                MstWitel::join('admin_role_users', 'admin_users.id', '=', 'admin_role_users.user_id')
                  ->where('admin_role_users.role_id', '2')->pluck('name', 'id')
              );
              $filter->in('mitra_id', 'MITRA')->multipleSelect(
                MstMitra::pluck('nama_mitra', 'id')
              );