app/Admin/Controllers/ViewInventoryController.php

select * from `tran_odp` limit 20 offset 0
select count(*) as aggregate from `tran_odp`
---
    function list(Request $request) {
        return Admin::content(function (Content $content) use ($request) {
            $query = TranOdp::query();

            // Filter data berdasarkan keyword pencarian
            $search = $request->input('search');
            if (!empty($search)) {
                $query->where(function ($q) use ($search) {
                    $q->where('project_name', 'like', "%$search%")
                        ->orWhere('project_name', 'like', "%$search%");
                });
            }

            // Ambil data dengan pagination
            $supervisis = $query->paginate(20);