app/Http/Controllers/Project/ActualController.php

select exists(select * from `tran_supervisi` where mitra_id = 43  AND id = 1) as `exists`
select * from `tran_supervisi` where mitra_id = 43  AND id = 1 limit 1
select * from `tran_baseline` where `project_id` = 67
select * from `tran_baseline` where `project_id` = 67 order by `plan_finish` asc
select * from `tran_baseline` where `project_id` = 67 and `plan_finish` is not null order by `plan_finish` desc limit 1
select * from `tran_baseline` where `project_id` = 67 and `actual_finish` is not null order by `actual_finish` desc limit 1
select count(*) as aggregate from `tran_baseline` where `project_id` = 67 and `bobot` >= '1'
select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 67 and `bobot` >= '1'
select count(*) as aggregate from `tran_baseline` where `project_id` = 67 and `plan_durasi` >= '1'
select count(*) as aggregate from `tran_baseline` where `project_id` = 67 and `actual_finish` >= '1'
select sum(`plan_durasi`) as aggregate from `tran_baseline` where `project_id` = 67 and `plan_durasi` >= '1'
select * from `mst_project` where `mst_project`.`id` = 67 and `mst_project`.`id` is not null and `mst_project`.`deleted_at` is null limit 1
select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 67 and `plan_finish` between '2023-04-01' and '2023-07-10'
select `actual_finish` from `tran_baseline` where `project_id` = 67 and `activity_id` = 2 limit 1
select min(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 002 ' and `project_id` = 67
select max(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 002 ' and `project_id` = 67
select min(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 003 ' and `project_id` = 67
select max(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 003 ' and `project_id` = 67
---
    public function actualActivity($id, $slug)
    {
        $user_id =  getUser()->id;
        if (activeGuard() == 'waspang') {
            $user = "waspang_id = $user_id ";
        } else if (activeGuard() == 'tim-ut') {
            $user = "tim_ut_id = $user_id ";
        } else {
            $user = "mitra_id = $user_id ";
        }

        $check = TranSupervisi::whereRaw("$user AND id = $id")->exists();
        if ($check == 0) {
            return abort(404);
        }
        $supervisi =  TranSupervisi::whereRaw("$user AND id = $id")->first();
        $lists = TranBaseline::where("project_id", $supervisi->project_id)->get();
        $lists_asc_date = TranBaseline::where("project_id", $supervisi->project_id)->orderBy('plan_finish', 'ASC')->get();
        $end_date_plan = TranBaseline::where("project_id", $supervisi->project_id)->whereNotNull('plan_finish')->orderBy('plan_finish', 'Desc')->first();
        $end_date_actual = TranBaseline::where("project_id", $supervisi->project_id)->whereNotNull('actual_finish')->orderBy('actual_finish', 'Desc')->first();
        $countBase = TranBaseline::where("project_id", $supervisi->project_id)->where('bobot', '>=', '1')->count();
        $sumBase = TranBaseline::where("project_id", $supervisi->project_id)->where('bobot', '>=', '1')->sum('bobot');
        $countPlan = TranBaseline::where("project_id", $supervisi->project_id)->where('plan_durasi', '>=', '1')->count();
        $countActual = TranBaseline::where("project_id", $supervisi->project_id)->where('actual_finish', '>=', '1')->count();
        $sumDurasi = TranBaseline::where("project_id", $supervisi->project_id)->where('plan_durasi', '>=', '1')->sum('plan_durasi');
        $today = date('Y-m-d');
        $progress_plan = TranBaseline::where("project_id", $supervisi->project_id)->whereBetween('plan_finish', [$supervisi->supervisi_project->start_date,  $today])->sum('bobot');

        $cek_last_preparing = TranBaseline::select('actual_finish')
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 2)
            ->first();
        $minActivityDelivery = TranBaseline::where('category_id', ' 002 ')
            ->where('project_id', $supervisi->project_id)
            ->min('activity_id');

        $maxActivityDelivery = TranBaseline::where('category_id', ' 002 ')
            ->where('project_id', $supervisi->project_id)
            ->max('activity_id');
        $minActivityInstalasi = TranBaseline::where('category_id', ' 003 ')
            ->where('project_id', $supervisi->project_id)
            ->min('activity_id');

        $maxActivityInstalasi = TranBaseline::where('category_id', ' 003 ')
            ->where('project_id', $supervisi->project_id)
            ->max('activity_id');

select exists(select `actual_finish` from `tran_baseline` where `project_id` = 67 and `actual_finish` is not null and `actual_finish` <> '' and `activity_id` = 20) as `exists`
select exists(select `actual_finish` from `tran_baseline` where `project_id` = 67 and `approval_tim_ut` = 'APPROVED' and `actual_finish` is not null and `actual_finish` <> '' and `activity_id` = 21) as `exists`
select exists(select `actual_finish` from `tran_baseline` where `project_id` = 67 and `actual_task` = 'APPROVED' and `actual_finish` is not null and `actual_finish` <> '' and `activity_id` = 22) as `exists`
select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 67 and `actual_progress` = 100
select sum(`progress_bobot`) as aggregate from `tran_baseline` where `project_id` = 67 and `actual_progress` between 1 and 99
---

        $cek_all_installasi_finish = cek_all_installasi_finish($supervisi->project_id);

        $cek_commisioning_tes = TranBaseline::select('actual_finish')
            ->where('project_id', $supervisi->project_id)
            ->whereNotNull('actual_finish')
            ->where('actual_finish', '<>', '')
            ->where('activity_id', 20)->exists();

        $cek_ut = TranBaseline::select('actual_finish')
            ->where('project_id', $supervisi->project_id)
            ->where('approval_tim_ut', 'APPROVED')
            ->whereNotNull('actual_finish')
            ->where('actual_finish', '<>', '')
            ->where('activity_id', 21)->exists();

        $cek_rekon = TranBaseline::select('actual_finish')
            ->where('project_id', $supervisi->project_id)
            ->where('actual_task', 'APPROVED')
            ->whereNotNull('actual_finish')
            ->where('actual_finish', '<>', '')
            ->where('activity_id', 22)->exists();
        $sum_selesai = TranBaseline::where("project_id", $supervisi->project_id)->where("actual_progress", 100)->sum('bobot');
        $sum_belum = TranBaseline::where("project_id", $supervisi->project_id)->whereBetween('actual_progress', [1, 99])->sum('progress_bobot');

select * from `tran_baseline` where `tran_baseline`.`id` = '1129' limit 1
select * from `log_actual` where `tran_baseline_id` = 1129 and `actual_message` is not null order by `id` desc limit 1
---
    public function actualActivityForm($id, $slug)
    {
        $baseline = TranBaseline::findOrFail($id);



        $remark = LogActual::where('tran_baseline_id', $baseline->id)
            ->whereNotNull('actual_message')

select * from `tran_baseline` where `tran_baseline`.`id` = '1129' limit 1
---
        $status_const = 'PREPARING';

        //DARI TABEL BASELINE
        $baseline = TranBaseline::findOrFail($request->baseline_id);

insert into `log_actual` (`project_id`, `tran_baseline_id`, `actual_volume`, `actual_progress`, `actual_evident`, `actual_status`, `actual_message`, `actual_kendala`, `progress_bobot`, `actual_start`, `actual_finish`, `actual_durasi`, `updated_at`, `created_at`) values (1877, 1129, '100', 4.9, '', 'belum', '', '', 0.3, '2023-07-08', '', '', '2023-07-10 10:18:26', '2023-07-10 10:18:26')
update `tran_baseline` set `actual_status` = 'belum', `actual_start` = '2023-07-08', `actual_finish` = '', `actual_task` = 'NEED UPDATED', `actual_progress` = 4.9, `actual_volume` = 1100, `actual_durasi` = '', `actual_message` = '', `actual_kendala` = '', `pending_item` = '', `tran_baseline`.`updated_at` = '2023-07-10 10:18:26' where `id` = 1129
---
            DB::beginTransaction();

            //SIMPAN KE LOG ACTUAL
            $logActual = LogActual::create([
                'project_id' => $baseline->project_id,
                'tran_baseline_id' => $baseline->id,
                'actual_volume' => $request->actual_volume,
                'actual_progress' =>  $actual_progress,
                'actual_evident' => $filesString,
                'actual_status' => $actual_status,
                'actual_message' => $actual_message,
                'actual_kendala' => $actual_kendala,
                'progress_bobot' => $progress_bobot,
                'actual_start' => $actual_start,
                'actual_finish' => $actual_finish,
                'actual_durasi' => $actual_durasi,
            ]);

            // UPDATE ACTUAL DI TRANSBASELINE
            TranBaseline::where("id", $baseline->id)
                ->update([
                    'actual_status' => $actual_status,
                    'actual_start' => $actual_start,
                    'actual_finish' => $actual_finish_verifikasi,
                    'actual_task' =>  $actual_task,
                    'actual_progress' =>  $actual_progress,
                    'actual_volume' =>  $actual_volume,
                    'actual_durasi' => $actual_durasi_verifikasi,
                    'actual_message' => $actual_message,
                    'actual_kendala' => $actual_kendala,
                    'pending_item' => $request->pending_item,
                ]);

select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 1877 and `activity_id` <= '16'
select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 1877 and `actual_progress` = 100
select sum(`progress_bobot`) as aggregate from `tran_baseline` where `project_id` = 1877 and `actual_progress` between 1 and 99
---
            $plan_finish_const = $baseline->plan_start;
            $sumPlanBobot = 0;
            if ($plan_finish_const <= $today) {
                $sumPlanBobot = TranBaseline::where("project_id", $baseline->project_id)->where('activity_id', '<=', $request->activity_id)->sum('bobot');
            }
            $sum_selesai = TranBaseline::where("project_id", $baseline->project_id)->where("actual_progress", 100)->sum('bobot');
            $sum_belum = TranBaseline::where("project_id", $baseline->project_id)->whereBetween('actual_progress', [1, 99])->sum('progress_bobot');

update `tran_supervisi` set `status_const` = 'MATERIAL DELIVERY ON SITE', `status_doc` = 'KONSTRUKSI', `progress_plan` = 74, `progress_actual` = 50, `remarks` = '', `kendala` = '', `task` = 'PROGRESS MATERIAL DELIVERY ON SITE', `plan_golive` = '', `tran_supervisi`.`updated_at` = '2023-07-10 10:18:27' where `project_id` = 1877
---
            if ($status_const == 'INSTALL DONE') {
                $plan_golive = date('Y-m-d', strtotime($today . ' + ' . $tambah_hari . ' days'));
            }
            TranSupervisi::where("project_id", $baseline->project_id)
                ->update([
                    'status_const' => $status_const,
                    'status_doc' => $status_doc,
                    'progress_plan' => $sumPlanBobot,
                    'progress_actual' =>  $sum_selesai + $sum_belum,
                    'remarks' => $actual_message,
                    'kendala' => $actual_kendala,
                    'task' => $task,
                    'plan_golive' => $plan_golive
                ]);

select * from `tran_supervisi` where `project_id` = 1877 limit 1
---
        }


        $supervisi = TranSupervisi::where("project_id", $baseline->project_id)->first();