app/Http/Controllers/Project/AdministrasiController.php

    public function administrasiActivity($id, $slug)
    {
        $user_id =  getUser()->id;
        if (activeGuard() == 'waspang') {
            $user = "waspang_id = $user_id ";
        } else if (activeGuard() == 'tim-ut') {
            $user = "tim_ut_id = $user_id ";
        } else {
            $user = "mitra_id = $user_id ";
        }

        $check = TranSupervisi::whereRaw("$user AND id = $id")->exists();
        if ($check == 0) {
            return abort(403);
        }
        $supervisi =  TranSupervisi::whereRaw("$user AND id = $id")->first();
        $pageTitle  = $supervisi->project_name;
        $lists = TranBaseline::where("project_id", $supervisi->project_id)->whereIn('activity_id', [22, 23])->get();
        $baseline = TranBaseline::where('project_id', $supervisi->project_id)->where('activity_id', 22)->first();
        $administrasi = TranAdministrasi::where('project_id', $supervisi->project_id)->first();
        $log_administrasi = LogAdministrasi::where('tran_administrasi_id', $administrasi->id)->get();
---
select exists(select * from `tran_supervisi` where mitra_id = 43  AND id = 1) as `exists`
select * from `tran_supervisi` where mitra_id = 43  AND id = 1 limit 1
select * from `tran_baseline` where `project_id` = 67 and `activity_id` in (22, 23)
select * from `tran_baseline` where `project_id` = 67 and `activity_id` = 22 limit 1
select * from `tran_administrasi` where `project_id` = 67 limit 1
select * from `log_administrasi` where `tran_administrasi_id` = 1 order by `id` desc