app/Http/Controllers/Project/PlanController.php

    public function planActivity($id, $slug)
    {
        $user_id =  getUser()->id;
        if (activeGuard() == 'waspang') {
            $user = "waspang_id = $user_id ";
        } else if (activeGuard() == 'tim_ut') {
            $user = "tim_ut_id = $user_id ";
        } else {
            $user = "mitra_id = $user_id ";
        }

        $check = TranSupervisi::whereRaw("$user AND id = $id")->exists();
        if ($check == 0) {
            return abort(404);
        }
        $supervisi =  TranSupervisi::whereRaw("$user AND id = $id")->first();


        $lists = TranBaseline::where("project_id", $supervisi->project_id)->get();
        $countBase = TranBaseline::where("project_id", $supervisi->project_id)->where('bobot', '>=', '1')->count();
        $sumBase = TranBaseline::where("project_id", $supervisi->project_id)->where('bobot', '>=', '1')->sum('bobot');
        $countPlan = TranBaseline::where("project_id", $supervisi->project_id)->where('plan_durasi', '>=', '1')->count();

        $plan_start = TranBaseline::select(['id', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 1)
            ->first();
        $plan_finish = TranBaseline::select(['id', 'plan_finish'])
            ->where('project_id', $supervisi->project_id)
            ->orderBy('plan_finish', 'DESC')
            ->first();
        $plan_durasi = selisih_hari($plan_start->plan_start, $plan_finish->plan_finish);


        $sumDurasi = TranBaseline::where("project_id", $supervisi->project_id)->where('plan_durasi', '>=', '1')->sum('plan_durasi');
        $cek_preparing = TranBaseline::select(['id', 'plan_finish', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 2)
            ->first();
        $cek_material = TranBaseline::select(['id', 'plan_finish', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('category_id', ' 002 ')
            ->orderBy('activity_id', 'desc')
            ->first();

        $cek_jointing = TranBaseline::select(['id', 'plan_finish', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 19)
            ->first();
        $cek_comtes = TranBaseline::select(['id', 'plan_finish', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 20)
            ->first();
        $cek_ut = TranBaseline::select(['id', 'plan_finish', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 21)
            ->first();
        $cek_rekon = TranBaseline::select(['id', 'plan_finish', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 22)
            ->first();
        $cek_bast = TranBaseline::select(['id', 'plan_finish', 'plan_start'])
            ->where('project_id', $supervisi->project_id)
            ->where('activity_id', 23)
            ->first();
        $minActivityDelivery = TranBaseline::where('category_id', ' 002 ')
            ->where('project_id', $supervisi->project_id)
            ->min('activity_id');

        $maxActivityDelivery = TranBaseline::where('category_id', ' 002 ')
            ->where('project_id', $supervisi->project_id)
            ->max('activity_id');

        $cek_all_delivery = TranBaseline::select('plan_finish')
            ->where('project_id', $supervisi->project_id)
            ->whereBetween('activity_id', [$minActivityDelivery, $maxActivityDelivery])
            ->count();

        $cek_all_delivery_finish = TranBaseline::select('plan_finish')
            ->where('project_id', $supervisi->project_id)
            ->whereNotNull('plan_finish')
            ->whereBetween('activity_id', [$minActivityDelivery, $maxActivityDelivery])
            ->count();

        $minActivityInstalasi = TranBaseline::where('category_id', ' 003 ')
            ->where('project_id', $supervisi->project_id)
            ->min('activity_id');

        $maxActivityInstalasi = TranBaseline::where('category_id', ' 003 ')
            ->where('project_id', $supervisi->project_id)
            ->max('activity_id');

        $cek_all_installasi = TranBaseline::select('plan_finish')
            ->where('project_id', $supervisi->project_id)
            ->whereBetween('activity_id', [$minActivityInstalasi, 19])->count();

        $cek_all_installasi_finish = TranBaseline::select('plan_finish')
            ->where('project_id', $supervisi->project_id)
            ->whereNotNull('plan_finish')
            ->whereBetween('activity_id', [$minActivityInstalasi, 19])->count();
---
select exists(select * from `tran_supervisi` where mitra_id = 7  AND id = 36) as `exists`
select * from `tran_supervisi` where mitra_id = 7  AND id = 36 limit 1
select * from `tran_baseline` where `project_id` = 1877
select count(*) as aggregate from `tran_baseline` where `project_id` = 1877 and `bobot` >= '1'
select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 1877 and `bobot` >= '1'
select count(*) as aggregate from `tran_baseline` where `project_id` = 1877 and `plan_durasi` >= '1'
select `id`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `activity_id` = 1 limit 1
select `id`, `plan_finish` from `tran_baseline` where `project_id` = 1877 order by `plan_finish` desc limit 1
select sum(`plan_durasi`) as aggregate from `tran_baseline` where `project_id` = 1877 and `plan_durasi` >= '1'
select `id`, `plan_finish`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `activity_id` = 2 limit 1
select `id`, `plan_finish`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `category_id` = ' 002 ' order by `activity_id` desc limit 1
select `id`, `plan_finish`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `activity_id` = 19 limit 1
select `id`, `plan_finish`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `activity_id` = 20 limit 1
select `id`, `plan_finish`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `activity_id` = 21 limit 1
select `id`, `plan_finish`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `activity_id` = 22 limit 1
select `id`, `plan_finish`, `plan_start` from `tran_baseline` where `project_id` = 1877 and `activity_id` = 23 limit 1
select min(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 002 ' and `project_id` = 1877
select max(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 002 ' and `project_id` = 1877
select count(*) as aggregate from `tran_baseline` where `project_id` = 1877 and `activity_id` between 3 and 9
select count(*) as aggregate from `tran_baseline` where `project_id` = 1877 and `plan_finish` is not null and `activity_id` between 3 and 9
select min(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 003 ' and `project_id` = 1877
select max(`activity_id`) as aggregate from `tran_baseline` where `category_id` = ' 003 ' and `project_id` = 1877
select count(*) as aggregate from `tran_baseline` where `project_id` = 1877 and `activity_id` between 12 and 19
select count(*) as aggregate from `tran_baseline` where `project_id` = 1877 and `plan_finish` is not null and `activity_id` between 12 and 19