app/Http/Controllers/Project/ProjectController.php

    public function jsonProject()
    {
        $where = '';

        $keyword = request()->input('keyword');
        if (!empty($keyword)) {
            $where .= "AND nama_paket LIKE '%$keyword%' ";
        }

        $jenis_pengadaan = request()->input('jenis_pengadaan');
        if (!empty($jenis_pengadaan) && $jenis_pengadaan != "All") {
            $where .= "AND jenis_pengadaan_id = '$jenis_pengadaan' ";
        }

        $tahun = request()->input('tahun');
        if (!empty($tahun) && $tahun != "All") {
            $where .= "AND tahun_anggaran = '$tahun' ";
        }

        $status_dokumen = request()->input('status_dokumen');
        if (!empty($status_dokumen) && $status_dokumen != "All") {
            $where .= "AND status_dokumen = '$status_dokumen' ";
        }

        $status_verifikasi = request()->input('status_verifikasi');
        if (!empty($status_verifikasi) && $status_verifikasi != "All") {
            $where .= "AND status_verifikasi = '$status_verifikasi' ";
        }
        $mitra_id =  getUser()->username;
        $pakets = MstProject::whereRaw("mitra_id = '$mitra_id' $where")
            ->with('sap')
            ->orderBy('id', 'ASC')
            ->get();
---
select * from `mst_project` where mitra_id = 'SPM001'  and `mst_project`.`deleted_at` is null order by `id` asc
select * from `mst_sap` where `mst_sap`.`name` in ('R7 MKS MAT PT3 Rosewood GMTD')

    public function detail($id, $slug)
    {
        $data = MstProject::findOrFail($id);
---
select * from `mst_project` where `mst_project`.`id` = '67' and `mst_project`.`deleted_at` is null limit 1