app/Http/Controllers/Project/SupervisiController.php

      $user = "mitra_id = $user_id ";
    }

    $results = TranSupervisi::whereRaw("$user $where")
      ->skip($skip)
      ->take($take)
      ->orderBy('id', 'DESC')
      ->get();
---
select * from `tran_supervisi` where mitra_id = 43   order by `id` desc limit 20 offset 0


        $status_const = ($supervisi->status_const) ? "$supervisi->status_const" : "BELUM ADA";
        $today = date('Y-m-d');
        $progress_plan = TranBaseline::where("project_id", $supervisi->project_id)->whereBetween('plan_finish', [$supervisi->supervisi_project->start_date,  $today])->sum('bobot');
---
select * from `mst_project` where `mst_project`.`id` = 67 and `mst_project`.`id` is not null and `mst_project`.`deleted_at` is null limit 1
select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 67 and `plan_finish` between '2023-04-01' and '2023-07-10'

  public function detail($id, $slug)
  {

    $profil = TranSupervisi::findOrFail($id);
    $data = MstProject::where('id', $profil->project_id)->first();
    $count = DB::table('tran_baseline')
      ->select(
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 1 AND 2 THEN id END) AS prepare'),
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 1 AND 2 AND actual_finish IS NOT NULL THEN id END) AS real_prepare'),
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 3 AND 9 THEN id END) AS delivery'),
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 3 AND 9 AND actual_finish IS NOT NULL THEN id END) AS real_delivery'),
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 10 AND 20 THEN id END) AS instalasi'),
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 10 AND 20 AND actual_finish IS NOT NULL THEN id END) AS real_instalasi'),
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 21 AND 23 THEN id END) AS closing'),
        DB::raw('COUNT(CASE WHEN project_id = ' . $profil->project_id . ' AND activity_id BETWEEN 21 AND 23 AND actual_finish IS NOT NULL THEN id END) AS closing_real')
      )
      ->first();
---
select * from `tran_supervisi` where `tran_supervisi`.`id` = '1' limit 1
select * from `mst_project` where `id` = 67 and `mst_project`.`deleted_at` is null limit 1
select COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 1 AND 2 THEN id END) AS prepare, COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 1 AND 2 AND actual_finish IS NOT NULL THEN id END) AS real_prepare, COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 3 AND 9 THEN id END) AS delivery, COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 3 AND 9 AND actual_finish IS NOT NULL THEN id END) AS real_delivery, COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 10 AND 20 THEN id END) AS instalasi, COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 10 AND 20 AND actual_finish IS NOT NULL THEN id END) AS real_instalasi, COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 21 AND 23 THEN id END) AS closing, COUNT(CASE WHEN project_id = 67 AND activity_id BETWEEN 21 AND 23 AND actual_finish IS NOT NULL THEN id END) AS closing_real from `tran_baseline` limit 1

  public function kurvaS($id)
  {
    $project = MstProject::where("id", $id)->first();
    $supervisi = TranSupervisi::where('project_id', $id)->first();
    // $lists = TranBaseline::where("project_id", $id)
    //     ->select('id', 'activity_id', 'bobot', 'plan_durasi', 'plan_start', 'plan_finish')
    //     ->get();
    $lists_asc_date = TranBaseline::where("project_id", $id)->orderBy('plan_finish', 'ASC')->get();
    $end_date_plan = TranBaseline::where("project_id", $id)->whereNotNull('plan_finish')->orderBy('plan_finish', 'Desc')->first();
    $end_date_actual = TranBaseline::where("project_id", $id)->whereNotNull('actual_finish')->orderBy('id', 'Desc')->first();

    $start = $project->start_date;
    $end_plan = $end_date_plan->plan_finish;
    $end_finish = 0;
    if ($end_date_actual) {
      $end_finish = $end_date_actual->actual_finish;
    }

    $end_today = date('Y-m-d'); //end dihari ini
    $end = $end_plan;
    if ($end_finish > $end_plan) {
      $end = $end_finish;
    }
    if ($supervisi->progress_actual < 100) {
      // $end = $end_today;
      $end = $end;
    }
    $sum_bobot_plan = LogPlan::where('project_id', $project->id)
      ->whereBetween('log_date', [$project->start_date, $start])
      ->sum('log_bobot');
    $sum_bobot_real = TranBaseline::where('project_id', $project->id)
      ->whereBetween('actual_start', [$project->start_date, $start])
      ->sum('bobot');
---
select * from `mst_project` where `id` = '67' and `mst_project`.`deleted_at` is null limit 1
select * from `tran_supervisi` where `project_id` = '67' limit 1
select * from `tran_baseline` where `project_id` = '67' and `plan_finish` is not null order by `plan_finish` desc limit 1
select * from `tran_baseline` where `project_id` = '67' and `actual_finish` is not null order by `id` desc limit 1
select sum(`log_bobot`) as aggregate from `log_plan` where `project_id` = 67 and `log_date` between '2023-04-01' and '2023-04-01'
select sum(`bobot`) as aggregate from `tran_baseline` where `project_id` = 67 and `actual_start` between '2023-04-01' and '2023-04-01'

        'bobot_real' => $sum_bobot_real
      ]);
      $start = date('Y-m-d', strtotime('+1 day', strtotime($start))); //looping tambah 1 date
      $sum_bobot_plan = LogPlan::where('project_id', $project->id)
        ->whereBetween('log_date', [$project->start_date, $start])
        ->sum('log_bobot');
---
select sum(`log_bobot`) as aggregate from `log_plan` where `project_id` = 67 and `log_date` between '2023-04-01' and '2023-04-02'