app/Http/Controllers/Dashboard/DashboardController.php

    public function index()
    {
        $insight = FALSE;
        $pageTitle  = "Selamat Datang <br> " . getUser()->name;
        $breadcrumb = [
            getUser()->name
        ];

        $user_id =  getUser()->id;
        if (activeGuard() == 'waspang') {
            $user = "waspang_id = $user_id ";
        } else if (activeGuard() == 'tim-ut') {
            $user = "tim_ut_id = $user_id ";
        } else {
            $user = "mitra_id = $user_id ";
        }

        $count_project = DB::table('mst_project')
            ->select(
                DB::raw('COUNT(CASE WHEN mitra_id = "' . getUser()->username . '"  THEN id END) AS project')
            )
            ->first();
        $count_supervisi = TranSupervisi::whereRaw("$user")
            ->count();
---
select count(*) as aggregate from `tran_supervisi` where mitra_id = 43